{"text": "Everyone should be well aware of the issues with these. If you have too much weight the legs slide out and you lose bodies and glass. The 3k can not safely hold 3kg. But I use it with about 1kg max and it works wonderfully and I couldn't be happier. I use this almost everyday and it's so great for vloggers on the go. We have a channel, Chestnut Oaks Homestead, where we are constantly outside doing work and don't want to lug a real tripod around and have to change plates. We can hold this and quickly spread the legs and set it down or attach to trees, tractors, fences, you name it.", "label": "Positive"}
{"text": "after using this for a while i come to realise that is not as good as i expected.", "label": "Negative"}
{"text": "Received a used product....the plastic around the box was broken and stuck with cello tape...very disappointed as wanted it urgently...", "label": "Negative"}
{"text": "I’ve used Joby products before and the are fantastic! I always appreciate a well built product and a tool that can be used for various projects, and great quality.", "label": "Positive"}
{"text": "The lack of a proper mount for the tripod", "label": "Negative"}
{"text": "This thing is amazing! I’ve gotten so much use out of this. From using it as a monopod to putting it in places you typically couldn’t get a good angle from, this thing is my new best friend. Anywhere my camera goes, the gorilla pod is attached to it. Would highly recommend for everyone! From amateur to professional photographers and videographers.", "label": "Positive"}
{"text": "This is a great little kit with ball head included. I only am giving it 4 stars because mine did not include any kind of quick release clamp for the tripod or quick release plate for the camera. You must screw it right into the camera which is not a good option for me.", "label": "Negative"}
{"text": "I've used it for 4-5 times at my home and never used it outdoors, but today I found out one of its joints is broken, as shown in the pics. Not sure if I should recommend this product...", "label": "Negative"}
{"text": "Very small. I refer to it as a TOY. Get the 5K, you’ll be glad you did.", "label": "Negative"}
{"text": "Trust me; spend a little more and get a Joby Gorilla Pod. I went cheap before buying this and the cheap one is no match for this.", "label": "Negative"}
{"text": "First time using it after purchase, broke before I even got on the plane for my vacation....", "label": "Negative"}
{"text": "Product seems like used. But quality is very good.", "label": "Neutral"}
{"text": "Work as expected.. bit expensive", "label": "Neutral"}
{"text": "The product was not suitable for my needs", "label": "Neutral"}
{"text": "Will be testing in in the field soon", "label": "Neutral"}
{"text": "the colour", "label": "Neutral"}